In [69]:
import pandas as pd

In [70]:
df=pd.read_csv('/Users/dylanbai/Desktop/Data Science/Assignments/sales_data.csv')

In [71]:
df  # although some datas of 'Sale Date' are future times, the task hasn't demonstrate the present time so i'm gonna consider the sale dates are all useful.

         Product    Region   Price  Units Sold   Sale Date
0            NaN  Region_6   75.96        10.0  2022-01-01
1            NaN  Region_1  175.78         8.0  2022-01-02
2     Product_46  Region_3   20.43        12.0  2022-01-03
3     Product_36  Region_1   12.77        10.0  2022-01-04
4     Product_17  Region_6  125.69         6.0  2022-01-05
...          ...       ...     ...         ...         ...
1045  Product_45  Region_7   78.69         8.0  2022-07-28
1046   Product_1  Region_6     NaN         8.0  2022-08-02
1047  Product_17  Region_2  114.37        11.0  2023-12-18
1048         NaN  Region_8     NaN         5.0  2023-12-27
1049  Product_16  Region_2   69.30         8.0  2024-02-23

[1050 rows x 5 columns]

In [72]:
df.info() #it seems that the data has some missing values.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Product     947 non-null    object
 1   Region      946 non-null    object
 2   Price       945 non-null    float64
 3   Units Sold  946 non-null    float64
 4   Sale Date   1050 non-null   object
dtypes: float64(2), object(3)
memory usage: 41.1+ KB

In [73]:
df=df.dropna() # prefer dropping the missing data to filling with 0

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 687 entries, 2 to 1049
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Product     687 non-null    object
 1   Region      687 non-null    object
 2   Price       687 non-null    float64
 3   Units Sold  687 non-null    float64
 4   Sale Date   687 non-null    object
dtypes: float64(2), object(3)
memory usage: 32.2+ KB

In [75]:
df.drop_duplicates(inplace=True)

/var/folders/xg/p7xsrph1757b22c90718xp3m0000gn/T/ipykernel_99738/3006716147.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop_duplicates(inplace=True)

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 651 entries, 2 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Product     651 non-null    object
 1   Region      651 non-null    object
 2   Price       651 non-null    float64
 3   Units Sold  651 non-null    float64
 4   Sale Date   651 non-null    object
dtypes: float64(2), object(3)
memory usage: 30.5+ KB

In [77]:
df.describe()

             Price  Units Sold
count   651.000000  651.000000
mean    107.254777   10.058372
std     131.283393    3.180658
min       0.200000    2.000000
25%      29.330000    8.000000
50%      76.010000   10.000000
75%     139.555000   12.000000
max    2143.300000   22.000000

In [78]:
df=df[(df['Price']>0)] #to make sure the 'Price' are all meaningful.

In [79]:
df.index

Index([  2,   3,   4,   5,   6,   7,   8,   9,  11,  13,
       ...
       977, 978, 980, 981, 982, 985, 993, 994, 998, 999],
      dtype='int64', length=651)

In [80]:
df.columns

Index(['Product', 'Region', 'Price', 'Units Sold', 'Sale Date'], dtype='object')

In [81]:
df.axes

[Index([  2,   3,   4,   5,   6,   7,   8,   9,  11,  13,
        ...
        977, 978, 980, 981, 982, 985, 993, 994, 998, 999],
       dtype='int64', length=651),
 Index(['Product', 'Region', 'Price', 'Units Sold', 'Sale Date'], dtype='object')]

In [82]:
df.dtypes

Product        object
Region         object
Price         float64
Units Sold    float64
Sale Date      object
dtype: object

In [83]:
df

        Product     Region   Price  Units Sold   Sale Date
2    Product_46   Region_3   20.43        12.0  2022-01-03
3    Product_36   Region_1   12.77        10.0  2022-01-04
4    Product_17   Region_6  125.69         6.0  2022-01-05
5    Product_45   Region_1    8.63        11.0  2022-01-06
6    Product_31   Region_3   23.73         6.0  2022-01-07
..          ...        ...     ...         ...         ...
985  Product_40   Region_7  144.37         5.0  2024-09-12
993   Product_7   Region_9  128.51        17.0  2024-09-20
994   Product_1   Region_4   95.24         7.0  2024-09-21
998   Product_2  Region_10   43.44        15.0  2024-09-25
999  Product_35   Region_8   56.95         6.0  2024-09-26

[651 rows x 5 columns]

In [84]:
df_grouped_region=df.groupby('Region')['Units Sold'].agg([sum,min,max])

In [85]:
df_grouped_region 
# create a new dataframe contains the 'units sold' information of different regions.

             sum  min   max
Region
Region_1   601.0  2.0  18.0
Region_10  745.0  4.0  16.0
Region_2   630.0  2.0  18.0
Region_3   599.0  2.0  19.0
Region_4   736.0  4.0  22.0
Region_5   656.0  2.0  20.0
Region_6   596.0  5.0  17.0
Region_7   467.0  3.0  19.0
Region_8   655.0  4.0  16.0
Region_9   863.0  3.0  17.0

In [86]:
df_grouped_region.sort_values('sum', ascending=False).head()
# To see which regions have the top sales of products.

             sum  min   max
Region
Region_9   863.0  3.0  17.0
Region_10  745.0  4.0  16.0
Region_4   736.0  4.0  22.0
Region_5   656.0  2.0  20.0
Region_8   655.0  4.0  16.0

In [87]:
df_grouped_product=df.groupby('Product')['Units Sold'].agg([sum,min,max])

In [88]:
df_grouped_product

              sum  min   max
Product
Product_1   160.0  7.0  16.0
Product_10  119.0  3.0  16.0
Product_11   80.0  8.0  14.0
Product_12   61.0  7.0  13.0
Product_13  206.0  2.0  19.0
Product_14  137.0  5.0  19.0
Product_15  124.0  5.0  14.0
Product_16  171.0  5.0  18.0
Product_17  155.0  5.0  15.0
Product_18  105.0  5.0  14.0
Product_19  171.0  5.0  15.0
Product_2   151.0  4.0  17.0
Product_20   78.0  7.0  17.0
Product_21  123.0  4.0  17.0
Product_22   78.0  7.0  11.0
Product_23  141.0  6.0  15.0
Product_24  122.0  4.0  16.0
Product_25  150.0  4.0  16.0
Product_26  113.0  5.0  14.0
Product_27  125.0  5.0  14.0
Product_28  106.0  4.0  16.0
Product_29  144.0  4.0  13.0
Product_3    83.0  3.0  17.0
Product_30  148.0  6.0  16.0
Product_31  209.0  3.0  17.0
Product_32   85.0  4.0  15.0
Product_33  165.0  3.0  15.0
Product_34  132.0  6.0  14.0
Product_35  127.0  4.0  15.0
Product_36   79.0  4.0  12.0
Product_37  146.0  3.0  14.0
Product_38   83.0  7.0  11.0
Product_39  108.0  4.0  13.0
Product_4   186.0  6.0  16.0
Product_40  133.0  5.0  17.0
Product_41  142.0  2.0  16.0
Product_42   99.0  4.0  18.0
Product_43  181.0  4.0  16.0
Product_44   91.0  4.0  14.0
Product_45  107.0  4.0  11.0
Product_46  143.0  6.0  14.0
Product_47  105.0  6.0  15.0
Product_48  198.0  6.0  15.0
Product_49  114.0  7.0  13.0
Product_5   190.0  2.0  20.0
Product_50  203.0  7.0  22.0
Product_6   115.0  2.0  16.0
Product_7   110.0  6.0  17.0
Product_8   121.0  7.0  17.0
Product_9   125.0  6.0  16.0

In [89]:
df_grouped_product.sort_values('sum', ascending=False).head()
# To see which product is sold most.

              sum  min   max
Product
Product_31  209.0  3.0  17.0
Product_13  206.0  2.0  19.0
Product_50  203.0  7.0  22.0
Product_48  198.0  6.0  15.0
Product_5   190.0  2.0  20.0

In [90]:
df[df['Region']=='Region_1'].sort_values(['Units Sold'],ascending=False).head()
# To see which product is sold most in Region_1

        Product    Region   Price  Units Sold   Sale Date
568  Product_42  Region_1    9.72        18.0  2023-07-23
922  Product_20  Region_1  241.39        17.0  2024-07-11
162   Product_2  Region_1  102.29        17.0  2022-06-12
110   Product_2  Region_1   29.39        16.0  2022-04-21
295  Product_13  Region_1   17.00        16.0  2022-10-23

In [91]:
df[df['Region']=='Region_2'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_2

        Product    Region   Price  Units Sold   Sale Date
796  Product_16  Region_2  272.83        18.0  2024-03-07
14    Product_3  Region_2   13.77        17.0  2022-01-15
23   Product_50  Region_2  249.30        16.0  2022-01-24
225   Product_3  Region_2   97.21        16.0  2022-08-14
47   Product_10  Region_2   58.50        16.0  2022-02-17

In [92]:
df[df['Region']=='Region_3'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_3

        Product    Region   Price  Units Sold   Sale Date
232  Product_14  Region_3  104.27        19.0  2022-08-21
105  Product_35  Region_3    6.26        15.0  2022-04-16
809  Product_11  Region_3  139.56        14.0  2024-03-20
299  Product_50  Region_3   51.82        14.0  2022-10-27
682   Product_4  Region_3   82.02        14.0  2023-11-14

In [93]:
df[df['Region']=='Region_4'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_4

        Product    Region   Price  Units Sold   Sale Date
719  Product_50  Region_4   86.73        22.0  2023-12-21
754  Product_10  Region_4    6.35        16.0  2024-01-25
527  Product_30  Region_4  100.80        16.0  2023-06-12
17   Product_17  Region_4   95.78        15.0  2022-01-18
294  Product_10  Region_4   72.41        15.0  2022-10-22

In [94]:
df[df['Region']=='Region_5'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_5

        Product    Region   Price  Units Sold   Sale Date
221   Product_5  Region_5   50.36        20.0  2022-08-10
909  Product_21  Region_5   46.99        17.0  2024-06-28
407   Product_1  Region_5   78.94        16.0  2023-02-12
854   Product_9  Region_5   55.17        16.0  2024-05-04
470   Product_4  Region_5  110.30        15.0  2023-04-16

In [95]:
df[df['Region']=='Region_6'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_6

        Product    Region   Price  Units Sold   Sale Date
805   Product_8  Region_6   97.30        17.0  2024-03-16
867  Product_43  Region_6   50.88        16.0  2024-05-17
191  Product_41  Region_6  133.13        16.0  2022-07-11
954  Product_13  Region_6   34.86        15.0  2024-08-12
659  Product_41  Region_6   31.13        15.0  2023-10-22

In [96]:
df[df['Region']=='Region_7'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_7

        Product    Region   Price  Units Sold   Sale Date
962  Product_13  Region_7    0.61        19.0  2024-08-20
342  Product_24  Region_7  177.75        16.0  2022-12-09
404  Product_23  Region_7   15.86        15.0  2023-02-09
652  Product_19  Region_7   59.37        15.0  2023-10-15
26   Product_11  Region_7   41.78        14.0  2022-01-27

In [97]:
df[df['Region']=='Region_8'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_8

        Product    Region   Price  Units Sold   Sale Date
565  Product_25  Region_8  208.94        16.0  2023-07-20
252  Product_18  Region_8   53.08        14.0  2022-09-10
276  Product_48  Region_8  418.24        14.0  2022-10-04
429  Product_48  Region_8  177.33        14.0  2023-03-06
552  Product_15  Region_8   94.30        14.0  2023-07-07

In [98]:
df[df['Region']=='Region_9'].sort_values(['Units Sold'],ascending=False).head()
# To se which product is sold most in Region_9

        Product    Region   Price  Units Sold   Sale Date
993   Product_7  Region_9  128.51        17.0  2024-09-20
974  Product_31  Region_9   29.92        17.0  2024-09-01
950  Product_40  Region_9   86.33        17.0  2024-08-08
955   Product_6  Region_9   14.36        16.0  2024-08-13
873  Product_24  Region_9   75.51        16.0  2024-05-23

In [99]:
df['Total_Income']=df['Price']*df['Units Sold']
# add a new column to calculate the total income of products.

In [100]:
df.sort_values(['Total_Income'],ascending=False)
# To see which region has the most total amount of income by selling which product.

        Product    Region    Price  Units Sold   Sale Date  Total_Income
969  Product_15  Region_8  2143.30         5.0  2024-08-27      10716.50
437  Product_26  Region_8   585.17        13.0  2023-03-14       7607.21
814  Product_26  Region_2   623.60        12.0  2024-03-25       7483.20
853  Product_41  Region_1   713.29        10.0  2024-05-03       7132.90
728  Product_31  Region_3   665.00         9.0  2023-12-30       5985.00
..          ...       ...      ...         ...         ...           ...
132  Product_39  Region_5     0.37        13.0  2022-05-13          4.81
456  Product_26  Region_4     0.20        14.0  2023-04-02          2.80
347   Product_9  Region_5     0.31         9.0  2022-12-14          2.79
201  Product_24  Region_4     0.22        10.0  2022-07-21          2.20
397  Product_10  Region_9     0.33         3.0  2023-02-02          0.99

[651 rows x 6 columns]

In [101]:
# Conclusions can be drawn from the data:
# ( Despite those sale dates of the future time because the period of the sales has not been specifically defined. )
# 1.Region_9 has  the highest sales volume of products, with 863 pieces;
# 2.Product_31 sells the most, with 209 pieces;
# 3.Different region seems to has different kind of popular product，by calculating the highest sale volume of different product.
# 4.The top 2 sales revenues are in Region_8 with Product_15 and Product_26.
# Recommmendations:
# 1.Focus on promoting the top-selling products in each region to maximize sales potential.
# 2.Allocate more resources and marketing efforts in the regions with the highest sales revenues.
# 3.Improve the quality or offer a better price of the product which has the maximum sale to further trigger customers' desire.
# Data Cleaning Approach:
# 1.handling the missing values;2.dropping duplicates;3. check the data types to make sure all columns has the correct types.